HomeWork-3/reports/1.2G/withIndex/wrk2-R10.txt
Running 5m test @ http://localhost:5000
  4 threads and 5 connections
  Thread calibration: mean lat.: 22.588ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 22.163ms, rate sampling interval: 67ms
  Thread calibration: mean lat.: 21.488ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 21.110ms, rate sampling interval: 66ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.85ms   15.63ms 155.90ms   94.21%
    Req/Sec     2.46      5.46    15.00     83.15%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.92ms
 75.000%   19.39ms
 90.000%   29.58ms
 99.000%  122.50ms
 99.900%  149.76ms
 99.990%  156.03ms
 99.999%  156.03ms
100.000%  156.03ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.861     0.000000            1         1.00
       9.319     0.100000          292         1.11
      10.679     0.200000          582         1.25
      11.775     0.300000          871         1.43
      12.719     0.400000         1161         1.67
      13.919     0.500000         1451         2.00
      14.671     0.550000         1595         2.22
      15.775     0.600000         1740         2.50
      16.719     0.650000         1886         2.86
      17.791     0.700000         2032         3.33
      19.391     0.750000         2176         4.00
      20.159     0.775000         2248         4.44
      21.007     0.800000         2321         5.00
      22.031     0.825000         2394         5.71
      23.215     0.850000         2465         6.67
      25.567     0.875000         2538         8.00
      28.287     0.887500         2575         8.89
      29.583     0.900000         2610        10.00
      30.831     0.912500         2647        11.43
      32.095     0.925000         2683        13.33
      33.183     0.937500         2719        16.00
      33.599     0.943750         2737        17.78
      34.207     0.950000         2757        20.00
      34.975     0.956250         2774        22.86
      35.967     0.962500         2792        26.67
      36.575     0.968750         2810        32.00
      37.439     0.971875         2819        35.56
      39.551     0.975000         2828        40.00
      41.823     0.978125         2837        45.71
      44.511     0.981250         2846        53.33
      50.367     0.984375         2855        64.00
     112.063     0.985938         2861        71.11
     114.751     0.987500         2864        80.00
     121.663     0.989062         2869        91.43
     122.879     0.990625         2873       106.67
     124.479     0.992188         2878       128.00
     125.375     0.992969         2880       142.22
     127.615     0.993750         2882       160.00
     129.599     0.994531         2885       182.86
     132.607     0.995313         2887       213.33
     135.167     0.996094         2889       256.00
     139.903     0.996484         2890       284.44
     140.031     0.996875         2891       320.00
     143.487     0.997266         2893       365.71
     147.327     0.997656         2894       426.67
     149.375     0.998047         2896       512.00
     149.375     0.998242         2896       568.89
     149.375     0.998437         2896       640.00
     149.759     0.998633         2897       731.43
     149.759     0.998828         2897       853.33
     151.295     0.999023         2898      1024.00
     151.295     0.999121         2898      1137.78
     151.295     0.999219         2898      1280.00
     153.215     0.999316         2899      1462.86
     153.215     0.999414         2899      1706.67
     153.215     0.999512         2899      2048.00
     153.215     0.999561         2899      2275.56
     153.215     0.999609         2899      2560.00
     156.031     0.999658         2900      2925.71
     156.031     1.000000         2900          inf
#[Mean    =       17.853, StdDeviation   =       15.630]
#[Max     =      155.904, Total count    =         2900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   13.12ms
 75.000%   18.66ms
 90.000%   28.83ms
 99.000%  121.54ms
 99.900%  148.86ms
 99.990%  155.01ms
 99.999%  155.01ms
100.000%  155.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.559     0.000000            1         1.00
       8.543     0.100000          290         1.11
       9.879     0.200000          580         1.25
      10.935     0.300000          870         1.43
      11.959     0.400000         1162         1.67
      13.119     0.500000         1450         2.00
      13.927     0.550000         1595         2.22
      15.007     0.600000         1740         2.50
      15.831     0.650000         1885         2.86
      17.119     0.700000         2032         3.33
      18.655     0.750000         2178         4.00
      19.327     0.775000         2248         4.44
      20.159     0.800000         2320         5.00
      21.151     0.825000         2394         5.71
      22.335     0.850000         2465         6.67
      24.975     0.875000         2539         8.00
      27.519     0.887500         2574         8.89
      28.831     0.900000         2610        10.00
      29.999     0.912500         2648        11.43
      31.199     0.925000         2683        13.33
      32.271     0.937500         2719        16.00
      32.895     0.943750         2737        17.78
      33.311     0.950000         2755        20.00
      34.079     0.956250         2775        22.86
      35.071     0.962500         2792        26.67
      35.743     0.968750         2811        32.00
      36.703     0.971875         2819        35.56
      38.943     0.975000         2828        40.00
      41.023     0.978125         2837        45.71
      43.903     0.981250         2846        53.33
      49.535     0.984375         2855        64.00
     110.399     0.985938         2860        71.11
     113.535     0.987500         2864        80.00
     121.215     0.989062         2869        91.43
     122.047     0.990625         2873       106.67
     123.903     0.992188         2878       128.00
     124.479     0.992969         2880       142.22
     126.719     0.993750         2882       160.00
     128.703     0.994531         2885       182.86
     131.711     0.995313         2887       213.33
     134.015     0.996094         2889       256.00
     139.007     0.996484         2890       284.44
     139.135     0.996875         2891       320.00
     143.103     0.997266         2893       365.71
     145.663     0.997656         2894       426.67
     148.095     0.998047         2895       512.00
     148.095     0.998242         2895       568.89
     148.351     0.998437         2896       640.00
     148.863     0.998633         2897       731.43
     148.863     0.998828         2897       853.33
     150.271     0.999023         2898      1024.00
     150.271     0.999121         2898      1137.78
     150.271     0.999219         2898      1280.00
     153.087     0.999316         2899      1462.86
     153.087     0.999414         2899      1706.67
     153.087     0.999512         2899      2048.00
     153.087     0.999561         2899      2275.56
     153.087     0.999609         2899      2560.00
     155.007     0.999658         2900      2925.71
     155.007     1.000000         2900          inf
#[Mean    =       17.044, StdDeviation   =       15.627]
#[Max     =      154.880, Total count    =         2900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3004 requests in 5.00m, 3.78MB read
Requests/sec:     10.01
Transfer/sec:     12.89KB